## Covariance And Correlation

In [1]:
import seaborn as sns

In [2]:
df = sns.load_dataset('healthexp')

In [3]:
df.head()

   Year        Country  Spending_USD  Life_Expectancy
0  1970        Germany       252.311             70.6
1  1970         France       192.143             72.2
2  1970  Great Britain       123.993             71.9
3  1970          Japan       150.437             72.0
4  1970            USA       326.961             70.9

In [4]:
df['Country'].unique()

array(['Germany', 'France', 'Great Britain', 'Japan', 'USA', 'Canada'],
      dtype=object)

In [5]:
import numpy as np

In [8]:
np.cov(df[['Year','Life_Expectancy']])

array([[1803860.18 , 1802340.66 , 1802625.57 , ..., 1842038.12 ,
        1837954.41 , 1845267.1  ],
       [1802340.66 , 1800822.42 , 1801107.09 , ..., 1840486.44 ,
        1836406.17 , 1843712.7  ],
       [1802625.57 , 1801107.09 , 1801391.805, ..., 1840777.38 ,
        1836696.465, 1844004.15 ],
       ...,
       [1842038.12 , 1840486.44 , 1840777.38 , ..., 1881024.08 ,
        1876853.94 , 1884321.4  ],
       [1837954.41 , 1836406.17 , 1836696.465, ..., 1876853.94 ,
        1872693.045, 1880143.95 ],
       [1845267.1  , 1843712.7  , 1844004.15 , ..., 1884321.4  ,
        1880143.95 , 1887624.5  ]])

In [11]:
d = df.drop(columns = ['Country'])

In [12]:
d.cov()

                         Year  Spending_USD  Life_Expectancy
Year               201.098848  2.571883e+04        41.915454
Spending_USD     25718.827373  4.817761e+06      4166.800912
Life_Expectancy     41.915454  4.166801e+03        10.733902

In [15]:
d.corr(method='pearson')

                     Year  Spending_USD  Life_Expectancy
Year             1.000000      0.826273         0.902175
Spending_USD     0.826273      1.000000         0.579430
Life_Expectancy  0.902175      0.579430         1.000000

In [19]:
d.corr(method='spearman')

                     Year  Spending_USD  Life_Expectancy
Year             1.000000      0.931598         0.896117
Spending_USD     0.931598      1.000000         0.747407
Life_Expectancy  0.896117      0.747407         1.000000

In [20]:
d.corr(method='kendall')

                     Year  Spending_USD  Life_Expectancy
Year             1.000000      0.787151         0.737203
Spending_USD     0.787151      1.000000         0.571620
Life_Expectancy  0.737203      0.571620         1.000000